Конфигурации/Tasks/ЗадачиИсполнителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Task>
		<Properties>
			<Name>ЗадачиИсполнителя</Name>
			<BasedOn>
				<xr:Item>Document.УправлениеЗадачей</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УправлениеЗадачей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Конфигурации/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресЭлПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Координатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияОбучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурации/Catalogs/УчетныеЗаписиЭлПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлПочты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресIMAP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресSMTP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортIMAP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурации/Tasks/ЗадачиИсполнителя/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УправлениеЗадачей") Тогда
		Основание = ДанныеЗаполнения;
		Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() И Основание.Исполнитель <> Справочники.Сотрудники.ПустаяСсылка() Тогда
		Если НЕ Задачи.ЗадачиИсполнителя.НайтиПоРеквизиту("Основание", ЭтотОбъект.Основание.Ссылка.Пустая()) Тогда
			Сообщить ("Задача по данноому документу уже заведена.");
			Отказ = Истина;
			Возврат;
		Иначе
			ОтправитьПисьмоНаПочту();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОтправитьПисьмоНаПочту()
	ПисьмоОтправлено = Ложь;

	УчетнаяЗаписьЭП = Справочники.УчетныеЗаписиЭлПочты.СистемнаяУчетнаяЗапись;
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	
	Профиль.АдресСервераIMAP = УчетнаяЗаписьЭП.АдресIMAP;
	Профиль.ПортIMAP = УчетнаяЗаписьЭП.ПортIMAP;
	Профиль.ПользовательIMAP = УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.ПарольIMAP = УчетнаяЗаписьЭП.Пароль;
	
	Профиль.АдресСервераSMTP =  УчетнаяЗаписьЭП.АдресSMTP;
	Профиль.ПортSMTP = УчетнаяЗаписьЭП.ПортSMTP;
	Профиль.ПользовательSMTP= УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.ПарольSMTP = УчетнаяЗаписьЭП.Пароль;
	Профиль.ИспользоватьSSLSMTP = Истина;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Профиль.Пользователь = УчетнаяЗаписьЭП.АдресЭлПочта;
	Профиль.Пароль = УчетнаяЗаписьЭП.Пароль;
	
	Почта = Новый ИнтернетПочта;
	Попытка
		Почта.Подключиться(Профиль);
	Исключение
		Сообщить("Не удалось подключиться к серверу почты отправителя! " + ОписаниеОшибки());
	КонецПопытки;
	 	
	Письмо = Новый ИнтернетПочтовоеСообщение;
	ТемаПисьма = "Новая задача в 1С:Управление сервисом ИТ";
	Письмо.Тема = НСтр("ru = '"+ТемаПисьма+"'");
	
	ТекстПисьма= Основание.Исполнитель.Наименование + ", Вам назначена новая задача """ + Наименование + """ от " + Дата + ".";
	Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстПисьма+"'"));
	
	Если Не ПустаяСтрока(Комментарий) Тогда
		ТекстКомментария = "Комментарий по задаче: " + Комментарий;
		Письмо.Тексты.Добавить( НСтр("ru = '"+ Символы.ПС +"'"));
		Письмо.Тексты.Добавить( НСтр("ru = '"+ТекстКомментария+"'"));
	КонецЕсли;
	
	Письмо.ИмяОтправителя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.ОтображаемоеИмя = НСтр("ru = '" + УчетнаяЗаписьЭП.Наименование + "'");
	Письмо.Отправитель.Адрес = УчетнаяЗаписьЭП.АдресЭлПочта;
	
	Получатели = Новый Массив;
	Получатели.Добавить(Основание.Исполнитель);
	
	Для каждого Получатель Из Получатели Цикл
		Если Получатель.АдресЭлПочты = "" Тогда
			Сообщить("У получателя "+Получатель.Наименование+" не указана почта! Письмо не будет отправлено.");
		Иначе 
			ПолучательПисьма = Письмо.Получатели.Добавить(Получатель.АдресЭлПочты);
			ПолучательПисьма.ОтображаемоеИмя = НСтр("ru = '"+Получатель.Наименование+"'");
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		Почта.Послать(Письмо);
		ПисьмоОтправлено = Истина;
	Исключение
		Сообщить("Не удалось отправить письмо! "+ ОписаниеОшибки());
	КонецПопытки;
		
	Почта.Отключиться();
	Письмо.Вложения.Очистить();	
	Если ПисьмоОтправлено Тогда
		Сообщить("Письмо успешно отправлено!");
	КонецЕсли;
КонецПроцедуры
